Revit 2023 API
FabricArea.FabricSheetTypeId Property
 The id of the Fabric Sheet Type for this element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2013
Syntax
C#
public ElementId FabricSheetTypeId { get; set; }
Visual Basic
Public Property FabricSheetTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ FabricSheetTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Changing the value of this property causes change of MinorLapSplice and MajorLapSplice properties if needed
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: fabricSheetTypeId is not a Fabric Sheet Type.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace